package com.example.soft1c.repository.model

data class LoadingBarcode(
    val barcode: String = "",
    val weight: Double = 0.0,
    val volume: Double = 0.0,
    val acceptanceNumber: String = "",
    val acceptanceUid: String = "",
    val seatNumber: Int = -1,
) {
    companion object {
        const val BARCODE_KEY = "ШтрихКод"
        const val WEIGHT_KEY = "Вес"
        const val VOLUME_KEY = "Объем"
        const val ACCEPTANCE_NUMBER_KEY = "НомерПриема"
        const val ACCEPTANCE_GUID_KEY = "ПриемТовара"
        const val SEAT_NUMBER_KEY = "НомерМеста"


        const val DEFAULT_DATA = """
            [
{
"Объем": 0.017204,
"Вес": 8.4,
"ПриемТовара": "e164a1f5-a23e-11eb-80da-b88303f1228d",
"Дата": "2021-04-21T06:14:12",
"НомерПриема": "GZ0005731",
"ШтрихКод": "90000153429210421",
"НомерМеста": 1,
"КоличествоМест": 1
},
{
"Объем": 0.069498,
"Вес": 33.93,
"ПриемТовара": "e164a1f5-a23e-11eb-80da-b88303f1228d",
"Дата": "2021-04-21T06:14:12",
"НомерПриема": "GZ0005731",
"ШтрихКод": "90000253429210421",
"НомерМеста": 2,
"КоличествоМест": 1
},
{
"Объем": 0.06032,
"Вес": 29.45,
"ПриемТовара": "e164a1f5-a23e-11eb-80da-b88303f1228d",
"Дата": "2021-04-21T06:14:12",
"НомерПриема": "GZ0005731",
"ШтрихКод": "90000353429210421",
"НомерМеста": 3,
"КоличествоМест": 1
},
{
"Объем": 0.072504,
"Вес": 35.39,
"ПриемТовара": "e164a1f5-a23e-11eb-80da-b88303f1228d",
"Дата": "2021-04-21T06:14:12",
"НомерПриема": "GZ0005731",
"ШтрихКод": "90000453429210421",
"НомерМеста": 4,
"КоличествоМест": 1
},
{
"Объем": 0.068952,
"Вес": 33.66,
"ПриемТовара": "e164a1f5-a23e-11eb-80da-b88303f1228d",
"Дата": "2021-04-21T06:14:12",
"НомерПриема": "GZ0005731",
"ШтрихКод": "90000553429210421",
"НомерМеста": 5,
"КоличествоМест": 1
},
{
"Объем": 0.05265,
"Вес": 25.7,
"ПриемТовара": "e164a1f5-a23e-11eb-80da-b88303f1228d",
"Дата": "2021-04-21T06:14:12",
"НомерПриема": "GZ0005731",
"ШтрихКод": "90000653429210421",
"НомерМеста": 6,
"КоличествоМест": 1
},
{
"Объем": 0.070278,
"Вес": 34.31,
"ПриемТовара": "e164a1f5-a23e-11eb-80da-b88303f1228d",
"Дата": "2021-04-21T06:14:12",
"НомерПриема": "GZ0005731",
"ШтрихКод": "90000753429210421",
"НомерМеста": 7,
"КоличествоМест": 1
},
{
"Объем": 0.070278,
"Вес": 34.31,
"ПриемТовара": "e164a1f5-a23e-11eb-80da-b88303f1228d",
"Дата": "2021-04-21T06:14:12",
"НомерПриема": "GZ0005731",
"ШтрихКод": "90000853429210421",
"НомерМеста": 8,
"КоличествоМест": 1
},
{
"Объем": 0.037224,
"Вес": 18.17,
"ПриемТовара": "e164a1f5-a23e-11eb-80da-b88303f1228d",
"Дата": "2021-04-21T06:14:12",
"НомерПриема": "GZ0005731",
"ШтрихКод": "90000953429210421",
"НомерМеста": 9,
"КоличествоМест": 1
},
{
"Объем": 0.038088,
"Вес": 18.59,
"ПриемТовара": "e164a1f5-a23e-11eb-80da-b88303f1228d",
"Дата": "2021-04-21T06:14:12",
"НомерПриема": "GZ0005731",
"ШтрихКод": "90001053429210421",
"НомерМеста": 10,
"КоличествоМест": 1
},
{
"Объем": 0.071604,
"Вес": 34.96,
"ПриемТовара": "e164a1f5-a23e-11eb-80da-b88303f1228d",
"Дата": "2021-04-21T06:14:12",
"НомерПриема": "GZ0005731",
"ШтрихКод": "90001153429210421",
"НомерМеста": 11,
"КоличествоМест": 1
},
{
"Объем": 0.05148,
"Вес": 25.13,
"ПриемТовара": "e164a1f5-a23e-11eb-80da-b88303f1228d",
"Дата": "2021-04-21T06:14:12",
"НомерПриема": "GZ0005731",
"ШтрихКод": "90001253429210421",
"НомерМеста": 12,
"КоличествоМест": 1
}
]
        """
    }
}
