package com.example.soft1c.repository.model

data class SizeAcceptance(
    var recordAllowed: Boolean = false,
    val sum: Double = 0.0,
    val allWeight: Double = 0.0,
    val priceM3: Double = 0.0,
    val priceWeight: Double = 0.0,
    var dataArray: List<SizeData>,
    var creator: String = ""
) {

    data class SizeData(
        var seatNumber: Int = 0,
        var length: Int = 0,
        var width: Int = 0,
        var height: Int = 0,
        var weight: Double = 0.0,
    )

    companion object{
        val DEFAULT_DATA = """
            {
    "ЗаписьРазрешена": true,
    "Сумма": 564.96,
    "ОбщийОбъем": 0.642005,
    "ЦенаЗаКуб": 880,
    "ЦенаЗаТонну": 2241.9,
    "КодКлиента": "12935",
    "КоличествоМест": 21,
    "ВидТовараНаименование": "Sumka (ayol sunniy)",
    "ВидТовараНаименованиеНаКитайском": "女士包（假皮）",
    "ТипУпаковкиНаименование": "Pres",
    "ТипУпаковкиНаименованиеНаКитайском": "铁丝包",
    "МассивДанных": [
        {
            "НомерМеста": 0,
            "Длина": 0,
            "Ширина": 0,
            "Высота": 0,
            "Объем": 0.0
        },
        {
            "НомерМеста": 1,
            "Длина": 0,
            "Ширина": 0,
            "Высота": 0,
            "Объем": 0.0
        },
        {
            "НомерМеста": 2,
            "Длина": 0,
            "Ширина": 0,
            "Высота": 0,
            "Объем": 0.0
        },
        {
            "НомерМеста": 3,
            "Длина": 0,
            "Ширина": 0,
            "Высота": 0,
            "Объем": 0.0
        },
        {
            "НомерМеста": 4,
            "Длина": 0,
            "Ширина": 0,
            "Высота": 0,
            "Объем": 0.0
        },
        {
            "НомерМеста": 5,
            "Длина": 0,
            "Ширина": 0,
            "Высота": 0,
            "Объем": 0.0
        },
        {
            "НомерМеста": 6,
            "Длина": 0,
            "Ширина": 0,
            "Высота": 0,
            "Объем": 0.0
        },
        {
            "НомерМеста": 7,
            "Длина": 0,
            "Ширина": 0,
            "Высота": 0,
            "Объем": 0.0
        },
        {
            "НомерМеста": 8,
            "Длина": 0,
            "Ширина": 0,
            "Высота": 0,
            "Объем": 0.0
        },
        {
            "НомерМеста": 9,
            "Длина": 0,
            "Ширина": 0,
            "Высота": 0,
            "Объем": 0.0
        },
        {
            "НомерМеста": 10,
            "Длина": 0,
            "Ширина": 0,
            "Высота": 0,
            "Объем": 0.0
        },
        {
            "НомерМеста": 11,
            "Длина": 0,
            "Ширина": 0,
            "Высота": 0,
            "Объем": 0.0
        },
        {
            "НомерМеста": 12,
            "Длина": 0,
            "Ширина": 0,
            "Высота": 0,
            "Объем": 0.0
        },
        {
            "НомерМеста": 13,
            "Длина": 0,
            "Ширина": 0,
            "Высота": 0,
            "Объем": 0.0
        },
        {
            "НомерМеста": 14,
            "Длина": 0,
            "Ширина": 0,
            "Высота": 0,
            "Объем": 0.0
        },
        {
            "НомерМеста": 15,
            "Длина": 0,
            "Ширина": 0,
            "Высота": 0,
            "Объем": 0.0
        },
        {
            "НомерМеста": 16,
            "Длина": 0,
            "Ширина": 0,
            "Высота": 0,
            "Объем": 0.0
        },
        {
            "НомерМеста": 17,
            "Длина": 0,
            "Ширина": 0,
            "Высота": 0,
            "Объем": 0.0
        },
        {
            "НомерМеста": 18,
            "Длина": 0,
            "Ширина": 0,
            "Высота": 0,
            "Объем": 0.0
        },
        {
            "НомерМеста": 19,
            "Длина": 0,
            "Ширина": 0,
            "Высота": 0,
            "Объем": 0.0
        },
        {
            "НомерМеста": 20,
            "Длина": 0,
            "Ширина": 0,
            "Высота": 0,
            "Объем": 0.0
        },
        {
            "НомерМеста": 21,
            "Длина": 0,
            "Ширина": 0,
            "Высота": 0,
            "Объем": 0.0
        }
    ],
    "ПараметрыВидимости": {
        "ViewOnly": true,
        "InputWeight": false,
        "InputSizes": false,
        "OwnDocument": false,
        "PropertiesProducts": false,
        "Zona": false,
        "Сheckbox": false,
        "AmountInPackage": false
    }
}
        """
    }

}